# running in fifo_formal/src/
read -formal fifo.sv
read -formal fifo_assertions.sv
read -formal fifo_formal.sv

prep -top fifo_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
