# running in uart_formal/src/
read -formal uart.sv
read -formal uart_assertions.sv
read -formal uart_formal.sv

prep -top uart_formal

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
